{"id":"doc1","structData":{"title":"Capital humano, transbordamento do conhecimento e complexidade econômica: Uma análise econométrica através de métodos globais e locais de microrregiões do Brasil","author":"Guilherme Viegas","year":2022,"relevance":["medium"],"abstract": "Há clara evidência de que o capital humano pode promover crescimento econômico, contudo pouco se sabe como as áreas do conhecimento da educação superior impactam a distribuição espacial da complexidade econômica em países emergentes, tal como o Brasil. Dada a escassez de fundos, busca-se a melhor alocação de recursos em educação. Naturalmente, não é factível nem efetivo promover cursos custosos, como engenharia ou medicina, em todas as 558 microrregiões do país. Ao invés disso, cursos como administração e direito são mais viáveis de serem oferecidos na maioria das regiões. Ao mesmo tempo, a política de localização dos cursos superiores deve também considerar os efeitos de transbordamento do capital humano sobre regiões vizinhas. Neste trabalho, utilizamos dados do Censo demográfico de 2010 e dados de exportação do Comex Stat para revelar o agrupamento espacial e os efeitos de transbordamento de 8 áreas do conhecimento da educação superior sobre a complexidade econômica nas microrregiões do Brasil. Métodos globais e locais mostram a concentração do capital humano e heterogeneidade no efeito do ensino superior sobre a complexidade econômica. Além disso, para todas as áreas do conhecimento analisadas, o efeito do transbordamento do capital humano sobre a complexidade econômica é maior na região Sudeste, indicando retornos crescentes de escala do capital humano onde habitantes com educação formal se concentram. Isso implica em um problema complexo para tomadores de decisão uma vez que o investimento mais efetivo de recursos em educação aumentaria ainda mais a desigualdade regional.","keywords":["Complexidade Econômica", "Capital Humano", "Educação", "Concentração", "Transbordamento do Conhecimento"],"language":"Portuguese","type":"bachelor_thesis"},"content":{"mimeType":"application/pdf","uri":"gs://personalhub14-discovery-bucket/bachelor_thesis_2022.pdf"}}
{"id":"doc2","structData":{"title":"Higher education, economic complexity, and knowledge spillovers across micro-regions of Brazil. A geographically weighted regression approach","author":"Guilherme Viegas","year":2023,"relevance":["medium"],"abstract": "There is clear evidence that human capital can promote economic growth, however little is known about how different higher education courses impact the spatial distribution of economic complexity in emerging countries, such as Brazil. Due to the scarcity of funds, decision-makers seek the best allocation of resources in education. Naturally, it is neither feasible nor effective to promote expensive courses, such as engineering or medicine, in all regions of the country. Instead, courses such as business and law are more likely to be offered in most regions. At the same time, the location policy of higher education courses must also consider the spillover effects of human capital over neighboring regions. In this work, we use data from the 2010 Demographic Census and exports from Comex Stat to reveal the spillover effects of higher education on economic complexity in Brazil's micro-regions. Geographically Weighted Regressions (GWR) outperformed Ordinary Least Squares regressions (OLS) and showed heterogeneous effects of higher education on economic complexity across space. Moreover, for all eight knowledge areas analyzed, the association with economic complexity is greater in the Southeast region, indicating increasing returns to scale. This leads to a difficult problem for policy-makers since the most effective investment in higher education, in terms of facilitating knowledge spillovers to productive sectors and increasing economic complexity, would further increase regional inequality. Yet, profound regional inequality is already a structural problem for economic development in Brazil.","keywords":["Higher Education", "Economic Complexity", "Knowledge Spillover", "Human Capital", "Brazil"],"language":"English","type":"publication"},"content":{"mimeType":"application/pdf","uri":"gs://personalhub14-discovery-bucket/knowledge_spillover_2023.pdf"}}
{"id":"doc3","structData":{"title":"Migration Dynamics in Brazil: A Spatial Econometric Analysis","author":"Guilherme Viegas","year":2025,"relevance":["medium"],"abstract": "People are increasingly opting to migrate in pursuit of a better life, a trend that has substantially influenced the polarization of social and economic development observed in Brazil and abroad. Voluntary migration can be motivated by numerous reasons, yet economic opportunities seem to have a recurrent importance in modern migration. This study employs econometric models—including Ordinary Least Squares (OLS), Spatial Auto Regression (SAR), Geographically Weighted Regression (GWR), Mixed Geographically Weighted Regression (MixedGWR), and Multiscale Geographically Weighted Regression (MultiscaleGWR)—to estimate the impact of socioeconomic factors on individuals' decisions to migrate to, from, and within Brazil. Through census data on emigration, immigration, and internal migration, the study aims to provide a broad understanding of migration determinants across 557 micro-regions of the federated Brazilian union by combining spatial econometric models and economic theory arguments. Additionally, the author provides a custom foundation model (LxM) to facilitate the exploration of referenced articles and books through a generative discovery search engine for his thesis. The concluding remarks highlight the importance of broader policies to mitigate migration issues, as it is a cause and a consequence of economic concentration in a multiscale core-periphery socioeconomic system.","keywords":["Migration", "Core-Periphery", "Brazil", "Spatial Econometrics", "Globalization"],"language":"English","type":"master_thesis"},"content":{"mimeType":"application/pdf","uri":"gs://personalhub14-discovery-bucket/master_thesis_2025.pdf"}}

