{"id":"doc0","structData":{"title":"Curriculum Vitae (CV)","author":"Guilherme Viegas","year":2025,"relevance":["high"],"abstract": "This document presents Guilherme Viegas's academic and professional background, including education, research experience, skills, and publications.","keywords":["CV", "Background", "Education", "Experience"],"language":"English","type":"cv"},"content":{"mimeType":"application/pdf","uri":"gs://personalhub14-discovery-bucket/cv_Guilherme_Viegas_2025.pdf"}}
{"id":"doc1","structData":{"title":"Presentation Letter","author":"Guilherme Viegas","year":2025,"relevance":["low"],"abstract": "This is a presentation letter meant to describe Guilherme and what his is able to do professionally.","keywords":["CV", "Background", "Education", "Experience"],"language":"English","type":"presentation_letter"},"content":{"mimeType":"application/pdf","uri":"gs://personalhub14-discovery-bucket/presentation_letter_2025.pdf"}}
{"id":"doc2","structData":{"title":"Capital humano, transbordamento do conhecimento e complexidade econômica: Uma análise econométrica através de métodos globais e locais de microrregiões do Brasil","author":"Guilherme Viegas","year":2022,"relevance":["medium"],"abstract": "Há clara evidência de que o capital humano pode promover crescimento econômico, contudo pouco se sabe como as áreas do conhecimento da educação superior impactam a distribuição espacial da complexidade econômica em países emergentes, tal como o Brasil. Dada a escassez de fundos, busca-se a melhor alocação de recursos em educação. Naturalmente, não é factível nem efetivo promover cursos custosos, como engenharia ou medicina, em todas as 558 microrregiões do país. Ao invés disso, cursos como administração e direito são mais viáveis de serem oferecidos na maioria das regiões. Ao mesmo tempo, a política de localização dos cursos superiores deve também considerar os efeitos de transbordamento do capital humano sobre regiões vizinhas. Neste trabalho, utilizamos dados do Censo demográfico de 2010 e dados de exportação do Comex Stat para revelar o agrupamento espacial e os efeitos de transbordamento de 8 áreas do conhecimento da educação superior sobre a complexidade econômica nas microrregiões do Brasil. Métodos globais e locais mostram a concentração do capital humano e heterogeneidade no efeito do ensino superior sobre a complexidade econômica. Além disso, para todas as áreas do conhecimento analisadas, o efeito do transbordamento do capital humano sobre a complexidade econômica é maior na região Sudeste, indicando retornos crescentes de escala do capital humano onde habitantes com educação formal se concentram. Isso implica em um problema complexo para tomadores de decisão uma vez que o investimento mais efetivo de recursos em educação aumentaria ainda mais a desigualdade regional.","keywords":["Complexidade Econômica", "Capital Humano", "Educação", "Concentração", "Transbordamento do Conhecimento"],"language":"Portuguese","type":"bachelor_thesis"},"content":{"mimeType":"application/pdf","uri":"gs://personalhub14-discovery-bucket/bachelor_thesis_2022.pdf"}}
{"id":"doc3","structData":{"title":"Higher education, economic complexity, and knowledge spillovers across micro-regions of Brazil. A geographically weighted regression approach","author":"Guilherme Viegas","year":2023,"relevance":["medium"],"abstract": "There is clear evidence that human capital can promote economic growth, however little is known about how different higher education courses impact the spatial distribution of economic complexity in emerging countries, such as Brazil. Due to the scarcity of funds, decision-makers seek the best allocation of resources in education. Naturally, it is neither feasible nor effective to promote expensive courses, such as engineering or medicine, in all regions of the country. Instead, courses such as business and law are more likely to be offered in most regions. At the same time, the location policy of higher education courses must also consider the spillover effects of human capital over neighboring regions. In this work, we use data from the 2010 Demographic Census and exports from Comex Stat to reveal the spillover effects of higher education on economic complexity in Brazil's micro-regions. Geographically Weighted Regressions (GWR) outperformed Ordinary Least Squares regressions (OLS) and showed heterogeneous effects of higher education on economic complexity across space. Moreover, for all eight knowledge areas analyzed, the association with economic complexity is greater in the Southeast region, indicating increasing returns to scale. This leads to a difficult problem for policy-makers since the most effective investment in higher education, in terms of facilitating knowledge spillovers to productive sectors and increasing economic complexity, would further increase regional inequality. Yet, profound regional inequality is already a structural problem for economic development in Brazil.","keywords":["Higher Education", "Economic Complexity", "Knowledge Spillover", "Human Capital", "Brazil"],"language":"English","type":"publication"},"content":{"mimeType":"application/pdf","uri":"gs://personalhub14-discovery-bucket/knowledge_spillover_2023.pdf"}}
{"id":"doc4","structData":{"title":"Did industrial and export complexity drive regional economic growth in Brazil?","author":"Guilherme Viegas","year":2025,"relevance":["low"],"abstract": "Research on productive structures has shown that economic complexity conditions economic growth. However, little is known about which type of complexity, e.g., export or industrial complexity, matters more for regional economic growth in a large emerging country like Brazil. Brazil exports natural resources and agricultural goods, but a large share of the employment derives from services, non-tradables, and within-country manufacturing trade. Here, we use a large dataset on Brazil’s formal labor market, including approximately 100 million workers and 581 industries, to reveal the patterns of export complexity, industrial complexity, and economic growth of 558 micro-regions between 2003 and 2019. Our results show that export complexity is more evenly spread than industrial complexity. Only a few mainly developed urban places have comparative advantages in sophisticated services. Regressions show that a region’s industrial complexity is a significant predictor for 3-year growth prospects, but export complexity is not. Moreover, economic complexity in neighboring regions is significantly associated with economic growth. The results show export complexity does not appropriately depict Brazil’s knowledge base and growth opportunities. Instead, promoting the sophistication of the heterogeneous regional industrial structures and development spillovers is a key to growth. This study demonstrates that industrial complexity, which accounts for all employment sectors, provides a more accurate basis for designing effective and inclusive industrial policies in emerging economies like Brazil, compared to export-based complexity.","keywords":["Economic Complexity", "Industrial Complexity", "Export Complexity", "Regional Economic Growth", "Brazil"],"language":"English","type":"publication"},"content":{"mimeType":"application/pdf","uri":"gs://personalhub14-discovery-bucket/industrial_and_export_complexity_2024.pdf"}}
{"id":"doc5","structData":{"title":"Migration Dynamics in Brazil: A Spatial Econometric Analysis","author":"Guilherme Viegas","year":2025,"relevance":["medium"],"abstract": "People are increasingly opting to migrate in pursuit of a better life, a trend that has substantially influenced the polarization of social and economic development observed in Brazil and abroad. Voluntary migration can be motivated by numerous reasons, yet economic opportunities seem to have a recurrent importance in modern migration. This study employs econometric models—including Ordinary Least Squares (OLS), Spatial Auto Regression (SAR), Geographically Weighted Regression (GWR), Mixed Geographically Weighted Regression (MixedGWR), and Multiscale Geographically Weighted Regression (MultiscaleGWR)—to estimate the impact of socioeconomic factors on individuals' decisions to migrate to, from, and within Brazil. Through census data on emigration, immigration, and internal migration, the study aims to provide a broad understanding of migration determinants across 557 micro-regions of the federated Brazilian union by combining spatial econometric models and economic theory arguments. Additionally, the author provides a custom foundation model (LxM) to facilitate the exploration of referenced articles and books through a generative discovery search engine for his thesis. The concluding remarks highlight the importance of broader policies to mitigate migration issues, as it is a cause and a consequence of economic concentration in a multiscale core-periphery socioeconomic system.","keywords":["Migration", "Core-Periphery", "Brazil", "Spatial Econometrics", "Globalization"],"language":"English","type":"master_thesis"},"content":{"mimeType":"application/pdf","uri":"gs://personalhub14-discovery-bucket/master_thesis_2025.pdf"}}
{"id":"doc6","structData":{"title":"Observatório SocioEconômico de Santa Catarina - OSESC","author":"Guilherme Viegas","year":2019,"relevance":["medium"],"abstract": "Como a escassez e não amplamente difundida acessibilidade à indicadores conjunturais referentes ao estado de Santa Catarina é algo que aflige qualquer pesquisador e/ou estudante de economia que pretenda se aprofundar na destacada temática socioeconômica Catarinense, apesar de haver bases de dados acerca do estado, se viu a oportunidade de criação da plataforma aqui apresentada. A motivação para o desenvolvimento de um ambiente virtual (interativo e dinâmico) que explorasse o comportamento das diferentes e disponíveis séries temporais referentes ao estado Catarinense surgiu com o intuito de ampliar a oportunidade de fundamentação de trabalhos, estudos e análises mais amplas e complexas acerca da economia catarinense a partir da aplicação automatizada de ferramentas relacionadas às abordagens quantitativas discutidas em sala de aula nos cursos de economia da Universidade Federal de Santa Catarina (UFSC).","keywords":["Santa Catarina", "Economia", "Series Temporais", "Dados", "Forecasting", "ARIMA"],"language":"Portuguese","type":"publication"},"content":{"mimeType":"application/pdf","uri":"gs://personalhub14-discovery-bucket/poster_OSESC_IV_SER_2019.pdf"}}
{"id":"doc7","structData":{"title":"Neutralidade da moeda na era covid19: Uma análise animada através do R","author": "Guilherme Viegas","year": 2020,"relevance":["medium"],"abstract": "Analisando os efeitos de políticas monetárias expansionistas sobre a inflação, juros e renda através de uma animação em R.","keywords": ["Economics", "Money", "Data Science", "Politics", "Programming"],"language": "Portuguese","type": "blog_post"},"content":{"mimeType":"application/pdf","uri":"gs://personalhub14-discovery-bucket/neutralidade_da_moeda_covid19_2020.pdf"}}
{"id":"doc8","structData":{"title":"Observações sobre os microdados do Censo: Extração, transformação e carregamento com Bash, PySpark e Cloud Storage","author": "Guilherme Viegas","year":2022,"relevance":["medium"],"abstract": "Extrair, transformar e carregar (ETL) grandes volumes de dados é sempre um desafio. Quanto maior o dado, mais sofisticadas devem ser as ferramentas. Pacotes convencionais, como pandas ou dplyr, se tornam inviáveis à medida que o tamanho do dado cresce. Neste artigo iremos explorar os microdados do censo demográfico através do pyspark, de maneira introdutória, para uso em trabalhos posteriores.","keywords": ["Census", "IBGE", "Big Data", "Python", "PySpark"],"language": "Portuguese","type": "blog_post"},"content":{"mimeType":"application/pdf","uri":"gs://personalhub14-discovery-bucket/observacoes_microdados_censo_2022.pdf"}}
{"id":"doc9","structData":{"title":"Imigração na região metropolitana de Lisboa: Uma análise espacial dos dados do Censo 2021 de Portugal","author": "Guilherme Viegas","year": 2023,"relevance":["medium"],"abstract": "This document presents Guilherme Viegas's academic and professional background, including education, research experience, skills, and publications.","keywords": ["Census", "Portugal", "Immigrants", "geography", "Society"],"language": "Portuguese","type": "blog_post"},"content": {"mimeType":"application/pdf","uri":"gs://personalhub14-discovery-bucket/imigracao_lisboa_2023.pdf"}}

